# Libraries being used <br>
1. numpy <br>
2. pandas

In [54]:
import numpy as np
import pandas as pd

In [55]:
df = pd.Series(range(1,5))
df

0    1
1    2
2    3
3    4
dtype: int64

In [56]:
d = {'a' : 1, 'b' : 2, 'c' : 3}
df = pd.Series(d)
df

a    1
b    2
c    3
dtype: int64

In [57]:
df = pd.DataFrame({'Number' : [1, 2, 3], 'Letter' : ['a', 'b', 'c']})
df

   Number Letter
0       1      a
1       2      b
2       3      c

In [58]:
df = pd.DataFrame({'Name' : ['Ankit', 'Agni', 'Martin', 'Pawan'], 'Roll No.' : ['19PH20046', '19PH20003', '19PH20017', '19PH20023']})
df.to_csv('test.csv', index=None)

In [59]:
df = pd.read_csv("test.csv")
df.head()

     Name   Roll No.
0   Ankit  19PH20046
1    Agni  19PH20003
2  Martin  19PH20017
3   Pawan  19PH20023